[
    {
        "id": 1,
        "name": "AutoModerator",
        "comment": "",
        "toxicity": 0
    },
    {
        "id": 2,
        "name": "PrettyLightzz",
        "comment": "This reminds me of South Park where Randy was like \"Stan, you call your friend an asshole RIGHT NOW\"",
        "toxicity": 1
    },
    {
        "id": 3,
        "name": "Spaghetti_Cartwheels",
        "comment": "But he was being a silly goose!",
        "toxicity": 0
    },
    {
        "id": 4,
        "name": "rcoolerthan_me",
        "comment": "Doing laundry with your dad is very gay.",
        "toxicity": 1
    },
    {
        "id": 5,
        "name": "madDarthvader2",
        "comment": "Oh you have a Dad? Bro that's gay.",
        "toxicity": 1
    },
    {
        "id": 6,
        "name": "Responsible_Farm1672",
        "comment": "Showing kindness is gay now lads",
        "toxicity": 1
    },
    {
        "id": 7,
        "name": "Dakzoo",
        "comment": "No, unless you are laying together in bed spooning as he slowly wakes up after a night of passionate lovemaking.\nThen super gay.",
        "toxicity": 1
    },
    {
        "id": 8,
        "name": "Its_noon_somewhere",
        "comment": "It’s not gay to say ‘good morning’ to another male, unless you’re cupping his crotch at the time.",
        "toxicity": 1
    },
    {
        "id": 9,
        "name": "mseg09",
        "comment": "Or if you're rolling over in bed to say it to him. It may be gay then.",
        "toxicity": 1
    },
    {
        "id": 10,
        "name": "ikiss-yomama",
        "comment": "It’s gay to talk to a man before noon",
        "toxicity": 1
    },
    {
        "id": 11,
        "name": "DaCozPuddingPop",
        "comment": "Unless 'tell another man good morning' is a euphemism for 'having sex with another man', then no, it's not gay.",
        "toxicity": 1
    },
    {
        "id": 12,
        "name": "ReflexDojo",
        "comment": "Dudes on Grindr now.",
        "toxicity": 0
    },
    {
        "id": 13,
        "name": "WorkAccess",
        "comment": "These \"macho men\" have such fragile masculinity that even being kind is seen as a gay act. It's a safe bet to assume that anybody that acts this hostile towards such a simple act has serious sexual insecurities about themselves.",
        "toxicity": 1
    },
    {
        "id": 14,
        "name": "thenaniwatiger",
        "comment": "I saw a video the other day of a gas station clerk in the hood giving out roses randomly, dudes had a meltdown over that shit lol",
        "toxicity": 1
    },
    {
        "id": 15,
        "name": "Zealousideal-Law-474",
        "comment": "It seems like the men who have no idea how to be masculine have all these weird, arbitrary rules on not being gay.\nFirst rule of man club is being confident in your sexuality, straight, gay, bi, just be you and don't care about other people having victimless relationships.",
        "toxicity": 1
    },
    {
        "id": 16,
        "name": "VomitingPotato",
        "comment": "EVERYONE knows \"Good morning!\" Is code for, \"I gobble cocks for breakfast and I'm famished you virile love muppet.\"",
        "toxicity": 0
    },
    {
        "id": 17,
        "name": "BondageKitty37",
        "comment": "Yeah I say \"Good Morning\":\nGobble\nOrgans\nOrally,\nDaniel.\nMy\nOrgasm\nRequires\nNubile Numerous\nIndecent,\nNaked\nGuys",
        "toxicity": 0
    },
    {
        "id": 18,
        "name": "SofterBones",
        "comment": "Life must be exhausting for these guys who are so terrified that they may be perceived to be gay for greeting someone, wearing a certain colored shirt or ordering a certain drink or dish at a restaurant.",
        "toxicity": 1
    },
    {
        "id": 19,
        "name": "ReptilianLaserbeam",
        "comment": "I must be super gay then for those guys… I greet everyone, I have several pink pieces of clothing , I sometimes like to order “girly” cocktails just for the fun of it… oh, and I wash my ass daily!",
        "toxicity": 1
    },
    {
        "id": 20,
        "name": "DocGerbill",
        "comment": "depends if you have his penis in your mouth when you say it or not",
        "toxicity": 0
    },
    {
        "id": 21,
        "name": "MissusNilesCrane",
        "comment": "Is it gay to *checks notes* use common courtesy?",
        "toxicity": 1
    },
    {
        "id": 22,
        "name": "ChuckFeathers",
        "comment": "Dude, scroll down the list, it's right there after taking a bath, just before drinking wine..",
        "toxicity": 0
    },
    {
        "id": 23,
        "name": "Rennergader",
        "comment": "Sounds like your dads gay",
        "toxicity": 1
    },
    {
        "id": 24,
        "name": "Nice_Notice9877",
        "comment": "This is my thought when I see such fragile masculinity. It would be sad if they weren’t such assholes about it.",
        "toxicity": 1
    },
    {
        "id": 25,
        "name": "missmermaidgoat",
        "comment": "And fighting VERY hard to admit it to himself.",
        "toxicity": 0
    },
    {
        "id": 26,
        "name": "svnonyx",
        "comment": "Or they have been taught that being gay is disgusting and being perceived as such will send them to hell. They are now passing that along to their children. Everyone that has a problem with gay people aren't all gay. The closest homophobe trope is overused to shift blame back onto the gay community.",
        "toxicity": 1
    },
    {
        "id": 27,
        "name": "WelbyReddit",
        "comment": "I really depends\n“Do you wish me a good morning,\nor mean that it is a good morning whether I want it or not;\nor that you feel good this morning;\nor that it is a morning to be good on?”\n-Gandalf",
        "toxicity": 1
    },
    {
        "id": 28,
        "name": "Longjumping_Bunch_53",
        "comment": "\"Or that you want to have homosexual sex this morning?\" -Gandalf in the extended edition",
        "toxicity": 1
    },
    {
        "id": 29,
        "name": "HarpoonNPuppies",
        "comment": "By the Valar Gandalf! Just accept the damn greeting and MOVE ON!",
        "toxicity": 0
    },
    {
        "id": 30,
        "name": "ResidentObligation30",
        "comment": "Don't ask don't tell (keep it secret; keep it safe)",
        "toxicity": 0
    },
    {
        "id": 31,
        "name": "WhichLecture4811",
        "comment": "All of them together, and a fine morning for a pipe out-of-doors into the bargain!",
        "toxicity": 0
    },
    {
        "id": 32,
        "name": "Allomancer_Ed",
        "comment": "Fellas, is it gay to greet a Maiar in the morning?",
        "toxicity": 1
    },
    {
        "id": 33,
        "name": "jhuseby",
        "comment": "Your dad’s wrong. Being attracted to the same sex makes you gay. People who put up a large front usually do so as a defensive mechanism. ie a lot of people worried about “appearing gay” are doing so for a reason. For the majority of people, they’re not worried about appearing gay or straight. Also your dad is implying there’s something wrong with being gay, there’s not. He sounds like like a shitty person, I wouldn’t base my life around his views or morals.",
        "toxicity": 1
    },
    {
        "id": 34,
        "name": "ScaredKnee4530",
        "comment": "My friend unironically thinks saying “Hi” to another man is gay. But it isn’t this defensive mechanism. He’s just ACTUALLY dumb, and thinks that’s a social standard.",
        "toxicity": 1
    },
    {
        "id": 35,
        "name": "Val_Hallen",
        "comment": "In the military, it's basically an expected custom to greet all superiors with a greeting of the day. It's either Good Morning, Good Afternoon, or Good Evening. Walk past your Sergeant Major without saying this and see how fast he hems you up.\nSo, unless dad there thinks all the military is gay, and judging by his overblown machismo I don't think he would, there is nothing wrong with that greeting.",
        "toxicity": 1
    },
    {
        "id": 36,
        "name": "LadyKokiri",
        "comment": "I said \"good morning\" once, and now im trans.\nYMMV",
        "toxicity": 0
    },
    {
        "id": 37,
        "name": "joana_pinkpilled",
        "comment": "good morning~",
        "toxicity": 0
    },
    {
        "id": 38,
        "name": "AJ_Crowley_29",
        "comment": "Fellas, is it gay to show basic human empathy towards another man?",
        "toxicity": 1
    },
    {
        "id": 39,
        "name": "OmegaGoober",
        "comment": "There are men who think it’s gay to wipe their ass.",
        "toxicity": 1
    },
    {
        "id": 40,
        "name": "Jellorage",
        "comment": "I don't think a straight man would be that insecure about which greeting they use unless they were hiding a few mornings in the closet.",
        "toxicity": 0
    },
    {
        "id": 41,
        "name": "lotsofhatemail",
        "comment": "No it's not gay. If anyone says it is then they are closet gays.\nHe who protests the most is usually hiding something.",
        "toxicity": 1
    },
    {
        "id": 42,
        "name": "Sour-Scribe",
        "comment": "My first thought as well",
        "toxicity": 0
    },
    {
        "id": 43,
        "name": "WatermelonCandy5",
        "comment": "Yeah because straight homophobes don’t exist and aren’t the overwhelming majority of homophobes. Much more likely the gay community is responsible for oppressing itself.",
        "toxicity": 1
    },
    {
        "id": 44,
        "name": "peter-doubt",
        "comment": "Sounds like Dad's a bit homophobic",
        "toxicity": 1
    },
    {
        "id": 45,
        "name": "shootymcghee",
        "comment": "His dad is the kind of guy who doesn't wash his ass because he thinks it's gay.",
        "toxicity": 1
    },
    {
        "id": 46,
        "name": "HossBonaventure2nd",
        "comment": "Hmmm... I think his dad might be in the closet. People aren't usually concerned about how gay saying \"good morning\" is.",
        "toxicity": 1
    },
    {
        "id": 47,
        "name": "whelksandhope",
        "comment": "There’s nothing wrong with being gay. Your father’s statement implies the opposite.\nThere’s nothing wrong with saying good morning.\nThe world will be better when the majority of age 60+ people stop having influence.",
        "toxicity": 1
    },
    {
        "id": 48,
        "name": "SerJaimeRegrets",
        "comment": "In reference to number 3, we’ll still have the Fundies, though.",
        "toxicity": 0
    },
    {
        "id": 49,
        "name": "Jam3Sandwich",
        "comment": "Number 1 was my biggest thought from the post. It's so frustrating that homophobic micro aggressions are so prevalent with macho masculinity.\nIt's very difficult to find a community of large tough strong men that enjoy masculine activities, without having to deal with constant bigotry and micro aggression against anyone who is different.",
        "toxicity": 1
    },
    {
        "id": 50,
        "name": "One-Guilty-Finger",
        "comment": "Hey ageism. I don’t know there’s any proven connection between being a homophobic asshole and being 60+ but if you have a valid study I’m overlooking please forward. I’m pushing 66 and love my gay buddies. Plus I say good morning and think less of guys who don’t at least acknowledge in some way.",
        "toxicity": 1
    },
    {
        "id": 51,
        "name": "PANDAmonium629",
        "comment": "Not unless you're saying it with his cock in your mouth as he wakes up. But that's also rude because you're not supposed to talk with your mouth full.",
        "toxicity": 0
    },
    {
        "id": 52,
        "name": "RansomReville",
        "comment": "It depends really, if you were sucking his dick while you said it that could come off as gay.",
        "toxicity": 1
    },
    {
        "id": 53,
        "name": "Volfgang91",
        "comment": "\"Fellas, is it gay to be polite?\"",
        "toxicity": 1
    },
    {
        "id": 54,
        "name": "jimmyeyess",
        "comment": "Not an insult at all but your dad's definitely gay.",
        "toxicity": 1
    },
    {
        "id": 55,
        "name": "notyomamasusername",
        "comment": "Or at least struggles with uncomfortable urges",
        "toxicity": 0
    },
    {
        "id": 56,
        "name": "TheCloudFestival",
        "comment": "I've seen late-game Jenga towers more secure than this guy's dad.",
        "toxicity": 0
    },
    {
        "id": 57,
        "name": "Mechagouki1971",
        "comment": "\"a little sweet\".\nIt's so depressing that there are still so many men in the world who think that random politeness may lead to them being penetrated against their will.",
        "toxicity": 0
    },
    {
        "id": 58,
        "name": "warpedashell",
        "comment": "Not as gay as being at a laundromat with your Dad.",
        "toxicity": 1
    },
    {
        "id": 59,
        "name": "Whatscheiser",
        "comment": "That's insane. Not trying to make it a military thing, but I mean in boot camp you basically get punished for not acknowledging the presence of a superior in this way. Good morning, Sir. Good afternoon, evening, etc... It's considered baseline respect to recognize their presence. So unless your Dad is making the argument that the U.S. Military is brainwashing its troops to be super gay, then no. This is not gay. In fact the only thing inherently gay is being in a romantic relationship with the same sex. No idea what your Dad is on about here. Just out of curiosity what area of the country are you all from?",
        "toxicity": 1
    },
    {
        "id": 60,
        "name": "un_blob",
        "comment": "No it is not",
        "toxicity": 0
    },
    {
        "id": 61,
        "name": "Rennergader",
        "comment": "GOOD MORNING",
        "toxicity": 0
    },
    {
        "id": 62,
        "name": "Pristine_Progress_48",
        "comment": "why are u gae",
        "toxicity": 0
    },
    {
        "id": 63,
        "name": "Sure-Fee1400",
        "comment": "What's up muther fuca, works fine and isn't gay.",
        "toxicity": 1
    },
    {
        "id": 64,
        "name": "peter-doubt",
        "comment": "Until it is!",
        "toxicity": 0
    },
    {
        "id": 65,
        "name": "Wise-Profile4256",
        "comment": "my raging gay boner. wanna bonk in the laundromat?",
        "toxicity": 1
    },
    {
        "id": 66,
        "name": "Mrorganic20",
        "comment": "Just text your dad good morning everyday or say it every time you see him",
        "toxicity": 0
    },
    {
        "id": 67,
        "name": "dessnom",
        "comment": "Fellas, is it gay to talk, like other men can hear you",
        "toxicity": 1
    },
    {
        "id": 68,
        "name": "Greenmantle22",
        "comment": "Your dad is a nut, and possibly coping with some repressed emotions under a layer of toxic masculinity.\nSay whatever you want to whomever you want. Words don’t alter your sexuality.",
        "toxicity": 1
    },
    {
        "id": 69,
        "name": "Ok-Environment8730",
        "comment": "Good morning everyone",
        "toxicity": 0
    },
    {
        "id": 70,
        "name": "[deleted]",
        "comment": "Your dad's gay and closeted",
        "toxicity": 1
    },
    {
        "id": 71,
        "name": "Wise-Profile4256",
        "comment": "You just know his dad was hanging out in laundromats in his twenties and good morning was code for \"i need a colon around my shaft\".",
        "toxicity": 0
    },
    {
        "id": 72,
        "name": "Sullock",
        "comment": "Why do people act like every homophobe is secretly gay? Is it that incomprehensible that a straight person could just hate gay people because they’re a bigot?",
        "toxicity": 1
    },
    {
        "id": 73,
        "name": "Danishmarks",
        "comment": "I always say “good morning” but that’s just because it’s so hard to say “what’s up” with a cock in my mouth",
        "toxicity": 0
    },
    {
        "id": 74,
        "name": "AggravatingBobcat574",
        "comment": "My non scientific opinion is that anyone who worries THAT much about something so innocent being gay, may be worried he might BE gay.",
        "toxicity": 1
    },
    {
        "id": 75,
        "name": "HeroicJakobis",
        "comment": "Older generation is DOGWATER",
        "toxicity": 0
    },
    {
        "id": 76,
        "name": "SalesGuy22",
        "comment": "Tell your Dad that's gay thinking, and only a gay guy would be worried about that. Tell him you are giving him a safe space to come out of the closet.\nTell him Good Morning every single day until you die now",
        "toxicity": 1
    },
    {
        "id": 77,
        "name": "kalusklaus",
        "comment": "This is the most fragile masculinity thing I read this week. Your dad is insecure and needs to put on a „man mask“ to hide it.",
        "toxicity": 0
    },
    {
        "id": 78,
        "name": "crustpope",
        "comment": "A) it’s not Gay and B) if they think it is Gay then that’s their problem not yours. If they really are that confused about whether you are gay or not they can ask. Assuming someone is gay because they greet you with “good morning” is something only insecure idiots do.",
        "toxicity": 1
    },
    {
        "id": 79,
        "name": "Street_Letterhead686",
        "comment": "0:00\n0:00\n0:00",
        "toxicity": 0
    },
    {
        "id": 80,
        "name": "NICEnEVILmike",
        "comment": "Toxic masculinity at its finest",
        "toxicity": 0
    },
    {
        "id": 81,
        "name": "ScaredKnee4530",
        "comment": "And just flat out stupidity",
        "toxicity": 1
    },
    {
        "id": 82,
        "name": "Shank__Hill",
        "comment": "But then they say \"not much, you?\" And you hit them back with a \"not much either\" and you're already 10ft away after passing one another. I'll just stick with good morning",
        "toxicity": 0
    },
    {
        "id": 83,
        "name": "b1gb0n312",
        "comment": "Sounds like performing gay sex acts to me",
        "toxicity": 1
    },
    {
        "id": 84,
        "name": "rufotris",
        "comment": "Your dad sounds like a complete D-bag. I’ll bet he buys Trump nfts",
        "toxicity": 0
    },
    {
        "id": 85,
        "name": "Cimmerian_Barbarian",
        "comment": "Waaay too many men feel threatened by simple acts of civility. Need to grow up.",
        "toxicity": 0
    },
    {
        "id": 86,
        "name": "WatermelonCandy5",
        "comment": "The fragility of male heterosexuality knows no bounds.",
        "toxicity": 1
    },
    {
        "id": 87,
        "name": "AnotherTAA123",
        "comment": "\"fellows, is it gay to kiss a girl? I mean you're literally kissing someone who likes men.\"",
        "toxicity": 1
    },
    {
        "id": 88,
        "name": "chainlinksawakening",
        "comment": "Unless you are mumbling good morning with a cock in your mouth, it's not gay, just polite.",
        "toxicity": 1
    },
    {
        "id": 89,
        "name": "IEeveelutionI",
        "comment": "FELLAS! Is it Gay to Exist?! You literally choose to exist in a world with Dick!",
        "toxicity": 0
    },
    {
        "id": 90,
        "name": "BrwnSugarGingerBread",
        "comment": "Sounds like his dad gets a boner when a man says good morning to him",
        "toxicity": 0
    },
    {
        "id": 91,
        "name": "SafferCA",
        "comment": "Fragile male crap. Do what you want and to hell with those that think otherwise.",
        "toxicity": 0
    },
    {
        "id": 92,
        "name": "Dehnus",
        "comment": "Man, how difficult life must be when you're that insecure.",
        "toxicity": 0
    },
    {
        "id": 93,
        "name": "Electrical-Page5188",
        "comment": "This dad has a lot of demons. And they all taste like other dude's meat.",
        "toxicity": 0
    },
    {
        "id": 94,
        "name": "Gen1Swirlix",
        "comment": "It's not gay if the balls don't touch. That's the rule, but if you're unsure, just say \"no homo.\" Saying \"no homo\" negates the gay and makes it straight, no matter what it is. That's the other rule.",
        "toxicity": 1
    },
    {
        "id": 95,
        "name": "bingbong6977",
        "comment": "Why won’t the boomers just die already",
        "toxicity": 0
    },
    {
        "id": 96,
        "name": "Spaghetti_Cartwheels",
        "comment": "Is it gay to repress your homosexuality, turn it into internalised homophobia, and live a lie as a straight man?",
        "toxicity": 1
    },
    {
        "id": 97,
        "name": "ganjaccount",
        "comment": "Anyone who thinks they are so close to being gay that a polite greeting will flip them, already goes to bed dreaming of cocks in their mouth and hates themselves for it.",
        "toxicity": 1
    },
    {
        "id": 98,
        "name": "Gregory_Grim",
        "comment": "Fellas, is acknowledging the presence of any other man gay?",
        "toxicity": 1
    },
    {
        "id": 99,
        "name": "internetcamp",
        "comment": "Toxic masculinity will kill us all.",
        "toxicity": 0
    },
    {
        "id": 100,
        "name": "ShinyBronzeArse",
        "comment": "\"Guys would things you're a little sweet\"\nThat's why I glare and grunt something unintelligible instead. Everybody thinks I am a little bitter.",
        "toxicity": 1
    },
    {
        "id": 101,
        "name": "revtim",
        "comment": "What went wrong in this person's life that they'd be so paranoid about being perceived as gay that they think random shit like that is some kind of queer signal?",
        "toxicity": 1
    },
    {
        "id": 102,
        "name": "Holy_Salsa",
        "comment": "Fuck, i must be gay, i say it to anyone i make eye contact with... does this breakthrough come with increased property value and an ability to dress wonderfully? I fuckin hope so",
        "toxicity": 1
    },
    {
        "id": 103,
        "name": "KlngSaj",
        "comment": "That's some classic 80s style homophobia right there.",
        "toxicity": 0
    },
    {
        "id": 104,
        "name": "guave06",
        "comment": "Social skills are gay fellas",
        "toxicity": 1
    },
    {
        "id": 105,
        "name": "GimmickyGenes",
        "comment": "What kinda bumblefuck hick town is this dude from lol",
        "toxicity": 1
    },
    {
        "id": 106,
        "name": "[deleted]",
        "comment": "It’s only gay if you do it with mouth full of cock and some bud light",
        "toxicity": 1
    },
    {
        "id": 107,
        "name": "tyriancomyn",
        "comment": "Jesus Christ it’s amazing how fragile these “real men” are.",
        "toxicity": 0
    },
    {
        "id": 108,
        "name": "mightybuffalo",
        "comment": "I hate to be the one to break it to you, but your dad's masculinity is wildly fragile.",
        "toxicity": 0
    },
    {
        "id": 109,
        "name": "mrdeadsniper",
        "comment": "I feel this is arethestraightsok material.",
        "toxicity": 0
    },
    {
        "id": 110,
        "name": "macgruff",
        "comment": "Goooooooood Morning Vietn….. ahem… Bigot-Dad!",
        "toxicity": 0
    },
    {
        "id": 111,
        "name": "OldGuySeattle",
        "comment": "Many people are blithely joking that your dad is gay. But the truth is, it’s quite possible that he does struggle with his sexuality. I’m gay, 64 years old. I’ve genuinely found that the more a guy expresses outlandish concern about someone thinking they’re gay, the more likely it is they’re insecure about themselves. If a straight man is confident in who he is, he would have no reason to be skittish around gay men or to have someone think he is gay.\nYour dad is an idiot, but I also feel sorry for him.",
        "toxicity": 1
    },
    {
        "id": 112,
        "name": "JohnnyQuestions36",
        "comment": "That guy and your dad are for sure having an affair.",
        "toxicity": 0
    },
    {
        "id": 113,
        "name": "ChaCha_real_smooth",
        "comment": "Bruh",
        "toxicity": 0
    },
    {
        "id": 114,
        "name": "Sufficient-Pin-481",
        "comment": "Good morning everyone!",
        "toxicity": 0
    },
    {
        "id": 115,
        "name": "jngjng88",
        "comment": "That's a bit of a reach-around, I mean a stretch-ed asshole...",
        "toxicity": 1
    },
    {
        "id": 116,
        "name": "Desperate_Move_5043",
        "comment": "Sounds like some good ol southern bullshit",
        "toxicity": 1
    },
    {
        "id": 117,
        "name": "MrCaptDrNonsense",
        "comment": "Your dad is dumb.",
        "toxicity": 1
    },
    {
        "id": 118,
        "name": "FatBobbyH",
        "comment": "I understand what he's saying, and he wasn't referencing people you know just strangers, however I disagree and you should do whatever the fuck you want brah",
        "toxicity": 1
    },
    {
        "id": 119,
        "name": "Andrelliina",
        "comment": "It's only gay if you kiss them tenderly on the mouth and say \"I love you\"",
        "toxicity": 1
    },
    {
        "id": 120,
        "name": "Chemy350",
        "comment": "You probably live in a tough area. I was brought up that way as well. I moved to a nicer area and now everybody says good morning. I think it’s area dependent....",
        "toxicity": 0
    },
    {
        "id": 121,
        "name": "Odd_Armadillo5315",
        "comment": "Being paranoid that saying good morning to another man would be admitting being gay is how you live to be old enough to have a 23 year old son but still can't afford a washing machine.",
        "toxicity": 1
    },
    {
        "id": 122,
        "name": "DieselGrappler",
        "comment": "The homophobia in some people is surreal.",
        "toxicity": 0
    },
    {
        "id": 123,
        "name": "thedudefromcali81",
        "comment": "Sorry but your dad is a fucking douche.",
        "toxicity": 1
    },
    {
        "id": 124,
        "name": "D_Quest",
        "comment": "Only if you say it in the evening.\nAlso you should incourage your dad to come out.",
        "toxicity": 0
    },
    {
        "id": 125,
        "name": "caramelstallion",
        "comment": "Dude, I think your dad’s gay.",
        "toxicity": 1
    },
    {
        "id": 126,
        "name": "Solesneaks",
        "comment": "It’s only gay if he’s sticking it in your poop-shoot as he says it.. and even then it’s questionable gay or not….",
        "toxicity": 1
    },
    {
        "id": 127,
        "name": "Foolish_Twerp",
        "comment": "This cannot be real. Can it?",
        "toxicity": 0
    },
    {
        "id": 128,
        "name": "kingerreddit",
        "comment": "The dad seems very insecure about his own sexuality",
        "toxicity": 1
    },
    {
        "id": 129,
        "name": "No_Cycle4088",
        "comment": "It is only gay if your tips touch, and you make eye contact. You’re good.",
        "toxicity": 1
    },
    {
        "id": 130,
        "name": "Kennedygoose",
        "comment": "The dad is being absurd. I am a certifiable fish gut covered redneck, cowboy hat and all, and I greet literally everyone with “Mornin’”, even in the afternoon.",
        "toxicity": 0
    },
    {
        "id": 131,
        "name": "Nadger_Badger",
        "comment": "I'm not sure which country this is from (although I can give an educated guess) but here in Australia it's only considered gay to wish another man good morning if it's done while you're having sex with him.",
        "toxicity": 1
    },
    {
        "id": 132,
        "name": "alexwol20091",
        "comment": "Just don't deepthroat it while sucking and saying good morning together, it's not gay then.",
        "toxicity": 1
    },
    {
        "id": 133,
        "name": "Eskidox",
        "comment": "No! It’s not like he stood to next urinal in an otherwise empty bathroom. Idk husband says that’s some upspoken rule man law.",
        "toxicity": 0
    },
    {
        "id": 134,
        "name": "nvalle23",
        "comment": "That's actually written....somewhere.",
        "toxicity": 0
    },
    {
        "id": 135,
        "name": "xc2215x",
        "comment": "No. It is not.",
        "toxicity": 0
    },
    {
        "id": 136,
        "name": "whyaremypantssoshort",
        "comment": "You're old enough to know this. You're dad's a fucking moron...",
        "toxicity": 1
    },
    {
        "id": 137,
        "name": "cupateam",
        "comment": "It is only gay if you say good morning to the man beside you in your bed at 8am",
        "toxicity": 1
    },
    {
        "id": 138,
        "name": "SuchVillage694",
        "comment": "But saying “you fellas alright” is an appropriate response to me. I’m in the south and that’s how I say “how are you doin” like half the time. Idk what the guys dad is thinking",
        "toxicity": 0
    },
    {
        "id": 139,
        "name": "Canadian__Bacon94",
        "comment": "\"Trust me son. I said good morning to a man when I was your age. Ended up having his cock in my mouth 5 mins later . He was so gay\"",
        "toxicity": 1
    },
    {
        "id": 140,
        "name": "k3ttch",
        "comment": "Your dad's a wee bit too defensive. Suspect he's closeted. Encourage him to come out.",
        "toxicity": 0
    },
    {
        "id": 141,
        "name": "mustsurvivecapitlism",
        "comment": "This guy’s dad is definitely gay",
        "toxicity": 1
    },
    {
        "id": 142,
        "name": "Nishun1383",
        "comment": "Why r u gay",
        "toxicity": 1
    },
    {
        "id": 143,
        "name": "RedTreeDecember",
        "comment": "I mean its pretty gay to call your boyfriend Dad, but other than that no its not gay to say Good Morning to anyone.",
        "toxicity": 1
    },
    {
        "id": 144,
        "name": "droppedelbow",
        "comment": "Unless you actually said \"Good morning wood!\" while pointing at his erection.... not very gay.",
        "toxicity": 1
    },
    {
        "id": 145,
        "name": "Painkiller_s",
        "comment": "Absurd is a polite word I'd use to describe your Dad...there are others.",
        "toxicity": 0
    },
    {
        "id": 146,
        "name": "Fluffy8Panda",
        "comment": "If your a homophobe like your father, sure",
        "toxicity": 0
    },
    {
        "id": 147,
        "name": "AthKaElGal",
        "comment": "Your dad is gay.",
        "toxicity": 1
    },
    {
        "id": 148,
        "name": "crazytumblweed999",
        "comment": "Good morning, my dudes.",
        "toxicity": 0
    },
    {
        "id": 149,
        "name": "Jmund89",
        "comment": "Good morning, my dude.",
        "toxicity": 0
    },
    {
        "id": 150,
        "name": "iEARNman848",
        "comment": "It's only gay to say \"Good Morning\" to another man if you wake up next to each other. 😉",
        "toxicity": 1
    },
    {
        "id": 151,
        "name": "Substantial-Secret31",
        "comment": "No, it’s not gay. I say good morning all the time. It’s only wrong after 12 noon",
        "toxicity": 1
    },
    {
        "id": 152,
        "name": "No-Equipment-9054",
        "comment": "Your dad senses the bitch in you.\n0:00\n0:00\n0:00",
        "toxicity": 1
    },
    {
        "id": 153,
        "name": "PsyckoJoe1992",
        "comment": "\"Good fucking morning!\"",
        "toxicity": 1
    },
    {
        "id": 154,
        "name": "FrickleFart90",
        "comment": "Dudes that claim to be “MEN 💪🏽” are very insecure and it shows when things like this happen. Little boys in adult bodies. Most of the time closeted.",
        "toxicity": 0
    },
    {
        "id": 155,
        "name": "BeerLeagueSnipes",
        "comment": "Someone check on America.",
        "toxicity": 0
    },
    {
        "id": 156,
        "name": "Mr_On1on",
        "comment": "it's in a critical state",
        "toxicity": 0
    },
    {
        "id": 157,
        "name": "Same-Competition-886",
        "comment": "You have to say “good morning, no-homo”",
        "toxicity": 0
    },
    {
        "id": 158,
        "name": "Manaze85",
        "comment": "Sounds more like someone’s dad has some skeletons in his closet.",
        "toxicity": 0
    },
    {
        "id": 159,
        "name": "vapecalibur",
        "comment": "There's a 96% chance your father is secretly gay lol.",
        "toxicity": 1
    },
    {
        "id": 160,
        "name": "surber17",
        "comment": "America, still trying to move on from 1630",
        "toxicity": 0
    },
    {
        "id": 161,
        "name": "No_Banana7768",
        "comment": "Your father is an idiot",
        "toxicity": 1
    },
    {
        "id": 162,
        "name": "judo_joel",
        "comment": "Yes, it is extremely gay",
        "toxicity": 1
    },
    {
        "id": 163,
        "name": "a_fat_Samoan",
        "comment": "Not at all. Dumbest shit I’ve heard.",
        "toxicity": 1
    },
    {
        "id": 164,
        "name": "TheBigFeIIa",
        "comment": "Unless you just woke up next to said man after a night of sticky lovemaking and said “good morning”, no it’s not gay.",
        "toxicity": 1
    },
    {
        "id": 165,
        "name": "NFTsEarlyNotWrong",
        "comment": "When I worked at the local factory in my early 20s, it was normal to say “mornin” as a greeting. Just to screw with the old blue collar guys, I would sometimes say “I’m horny” instead. When said fast, they basically sound the same. Dumb little laugh to keep myself from going insane on a soul sucking job.",
        "toxicity": 0
    },
    {
        "id": 166,
        "name": "HowFunkyIsYourChiken",
        "comment": "Wrong question. The right question is “why is my father such a homophobe?”",
        "toxicity": 0
    },
    {
        "id": 167,
        "name": "Confident-Stock-3816",
        "comment": "As long as you say, “Good morning! No homo”",
        "toxicity": 0
    },
    {
        "id": 168,
        "name": "The_Purple_Ripple",
        "comment": "Is it not common knowledge that the phrase \"Good morning\" stimulates the prostate?",
        "toxicity": 0
    },
    {
        "id": 169,
        "name": "Victrolencio",
        "comment": "If your dad thinks that, I think \"someone\" is secretly gay.",
        "toxicity": 1
    },
    {
        "id": 170,
        "name": "NaturalizedCanadian",
        "comment": "It is very gay indeed, for instance I often say it in bed to my gay husband when we wake up. /s",
        "toxicity": 1
    },
    {
        "id": 171,
        "name": "Grand_Yogurtcloset20",
        "comment": "His dad was only looking out for him. That's what dad's do. In this case context would also matter.",
        "toxicity": 0
    },
    {
        "id": 172,
        "name": "faranoox",
        "comment": "I haven't thought this much about saying good morning since The Hobbit.",
        "toxicity": 0
    },
    {
        "id": 173,
        "name": "EagleChampLDG",
        "comment": "No. Being gay is having sex/loving another man, speaking as a man. Everything else is just being a person. Your dads weird phobias are your dads. Not to say he isn’t recognizing a certain social construct, but reality dictates a different understanding.",
        "toxicity": 1
    },
    {
        "id": 174,
        "name": "esp735",
        "comment": "So, Florida or Texas?",
        "toxicity": 0
    },
    {
        "id": 175,
        "name": "lolograde",
        "comment": "And that's how OP found out his dad is a closeted, deeply repressed homosexual.",
        "toxicity": 1
    },
    {
        "id": 176,
        "name": "Groovy_Spider",
        "comment": "Fellas, is it gay to speak to another man?",
        "toxicity": 1
    },
    {
        "id": 177,
        "name": "qdubbya",
        "comment": "“You know how I know you’re gay?! Your dick taste like shit..”",
        "toxicity": 1
    },
    {
        "id": 178,
        "name": "stricknineglass",
        "comment": "Your dad has super gay thoughts",
        "toxicity": 1
    },
    {
        "id": 179,
        "name": "Cake-Over",
        "comment": "It's extra, super hetero to whisper it seductively into another man's ear.",
        "toxicity": 0
    },
    {
        "id": 180,
        "name": "Long-Zombie-2017",
        "comment": "That's ridiculous and homophobic. It's perfectly fine to say good morning to another man. Idk if that's a regional thing or not perhaps but in the south it's a normal greeting. But only when it's morning lol",
        "toxicity": 1
    },
    {
        "id": 181,
        "name": "Next-Quality2895",
        "comment": "I hate to break it to you but your dad is gay.",
        "toxicity": 1
    },
    {
        "id": 182,
        "name": "chaosrain8",
        "comment": "Don't talk to another guy, that's gay.",
        "toxicity": 1
    },
    {
        "id": 183,
        "name": "WillyWankrGunner",
        "comment": "Good morning guys. (No homo)",
        "toxicity": 0
    },
    {
        "id": 184,
        "name": "FriedPuppy",
        "comment": "You counter the “good morning” part by adding “motherfucker” at the end to make it super not gay.",
        "toxicity": 1
    },
    {
        "id": 185,
        "name": "FlyAirLari",
        "comment": "Top of the morning to all of you!",
        "toxicity": 0
    },
    {
        "id": 186,
        "name": "younggundc",
        "comment": "Only gay saying good morning when you’re waking up next to him naked. Even then, it’s a little blurry. It’s not gay if it’s a three way.\nGreet people how you want to greet them.",
        "toxicity": 1
    },
    {
        "id": 187,
        "name": "HellTrent",
        "comment": "What is wrong with your father?????",
        "toxicity": 0
    },
    {
        "id": 188,
        "name": "TryNitroToluene",
        "comment": "Good morning, from a fellow straight male.\nIt is not gay. Your father has gone off the deep end.",
        "toxicity": 1
    },
    {
        "id": 189,
        "name": "Vikingseed",
        "comment": "The most absurd thing I’ve ever heard. Makes no sense.",
        "toxicity": 0
    },
    {
        "id": 190,
        "name": "watchdogman1781",
        "comment": "Crazy boomer shit",
        "toxicity": 1
    },
    {
        "id": 191,
        "name": "hrhpixierose",
        "comment": "Are the straights ok?",
        "toxicity": 0
    },
    {
        "id": 192,
        "name": "MysticFox96",
        "comment": "As a 26 year old woman I have to say that the dad in this story is absurd. Fuck the patriarchy man - this isn't fair to young men and darn sure 'aint healthy for anybody!",
        "toxicity": 0
    },
    {
        "id": 193,
        "name": "Shadowfoot",
        "comment": "I hate being asked what’s up, or what’s going on, because they are questions. Saying good morning is a way of acknowledging the other person without anything more.",
        "toxicity": 0
    },
    {
        "id": 194,
        "name": "ehermo",
        "comment": "Maybe your dad is gay.",
        "toxicity": 1
    },
    {
        "id": 195,
        "name": "hodl42weeks",
        "comment": "If you said \"I'm gay\" to another man, that is probably a bit gay.",
        "toxicity": 1
    },
    {
        "id": 196,
        "name": "ZealousidealBid3988",
        "comment": "Only if you come in singing “goood moooorning, Goood Mooooo-ooooorrrnn!! - in that musical theatre Elaine from Seinfeld sing-songy voice. Other wise it’s fine",
        "toxicity": 0
    },
    {
        "id": 197,
        "name": "spaceguitar",
        "comment": "No, it’s not gay. Not on its face it is, anyways.\nHowever, if you live in the ‘hood or otherwise come from a machismo culture where kindness or softness is otherwise perceived as weakness, or feminine? Then yeah, saying “good morning!” to another man that’s your peer or as dad says here, your same age, then it will be perceived as gay.",
        "toxicity": 1
    },
    {
        "id": 198,
        "name": "Booby_Collector",
        "comment": "Just make sure you don't tell them \"good afternoon\"",
        "toxicity": 0
    },
    {
        "id": 199,
        "name": "Gooseman61oh",
        "comment": "Sounds like his dad is gay",
        "toxicity": 1
    },
    {
        "id": 200,
        "name": "Grouchy-Ad6144",
        "comment": "Could be the eye contact and not what you said, but how you said it. Bottom line, if you’re an adult, you don’t have to listen to dear old dad. Prolonged eye contact can be seen as flirting, but it can also just be being friendly. Sounds like Dad is overreacting.",
        "toxicity": 0
    },
    {
        "id": 201,
        "name": "morrisgrand",
        "comment": "I hate to tell you, but your dad is very, very closeted gay man.\nTrust me",
        "toxicity": 1
    },
    {
        "id": 202,
        "name": "evilsewingmachine",
        "comment": "It feels right to me, as a man, to walk with my head high, chest out, able to hold anyone’s gaze. I’ll say good morning to whoever I damn well please, I own the place.",
        "toxicity": 0
    },
    {
        "id": 203,
        "name": "Looogan_",
        "comment": "I think your dad is gay.",
        "toxicity": 1
    },
    {
        "id": 204,
        "name": "swirlll",
        "comment": "It’s actually gay to think it’s gay for saying good morning to another person.",
        "toxicity": 1
    },
    {
        "id": 205,
        "name": "wartune1313",
        "comment": "Nah it's not gay for work or for any other place, I think your dad is just thinking too much about gay things since a long time, tell him to come out of the fucking closet.",
        "toxicity": 1
    },
    {
        "id": 206,
        "name": "Human_Fucker69420",
        "comment": "After you say no homo",
        "toxicity": 0
    },
    {
        "id": 207,
        "name": "jambr380",
        "comment": "Good morning wood",
        "toxicity": 0
    },
    {
        "id": 208,
        "name": "rakawido",
        "comment": "The father is so absurd it's tragic.",
        "toxicity": 1
    },
    {
        "id": 209,
        "name": "SugarEmbarrassed8945",
        "comment": "Goog morning all of you",
        "toxicity": 0
    },
    {
        "id": 210,
        "name": "Fabulous-Meal-5694",
        "comment": "TiL I'm gay. Ffs time to go tell my wife and kids.",
        "toxicity": 1
    },
    {
        "id": 211,
        "name": "ThreeAMscroller",
        "comment": "As a gay myself, I tell all the dudes in my path good morning. No one is safe from my gayness",
        "toxicity": 1
    },
    {
        "id": 212,
        "name": "Alimakakos",
        "comment": "That's pretty hyper homophobic to think a standard greeting would pass as being 'too sweet' ie gay but I guess your dad is one of those guys super worried about what everyone else thinks of him, like he's gay something...",
        "toxicity": 1
    },
    {
        "id": 213,
        "name": "PhalanxA51",
        "comment": "Well good to know that literally every man at work and comes into my office for tax shit are all gay. The more you know I guess",
        "toxicity": 1
    },
    {
        "id": 214,
        "name": "Dry_Adeptness7843",
        "comment": "“You’re a little sweet”?! 😂 That’s hilarious! I’ve never heard that before",
        "toxicity": 0
    },
    {
        "id": 215,
        "name": "Queasy-Department382",
        "comment": "This never happened",
        "toxicity": 0
    },
    {
        "id": 216,
        "name": "TuorSonOfHuor",
        "comment": "This gays dad is 100% a closet gay",
        "toxicity": 1
    },
    {
        "id": 217,
        "name": "ShadeDust",
        "comment": "gay (adj.) late 14c., \"full of joy, merry; light-hearted, carefree;\"\nIt's very gay",
        "toxicity": 1
    },
    {
        "id": 218,
        "name": "ChampionshipLow8541",
        "comment": "If this is real, your dad is an idiot.",
        "toxicity": 1
    },
    {
        "id": 219,
        "name": "Slytherin_Sicairos",
        "comment": "I never thought it was “Gay”",
        "toxicity": 0
    },
    {
        "id": 220,
        "name": "AlreadyAway",
        "comment": "You know, the stereotypical gay gruff western sheriff who tips his hat and says \"mornin' \".... I suppose he was a little sweet too.",
        "toxicity": 1
    },
    {
        "id": 221,
        "name": "roadcrew778",
        "comment": "Dad’s an idiot. Not saying he’s alone in this, but an idiot just the same.",
        "toxicity": 1
    },
    {
        "id": 222,
        "name": "GreatNoodleLord",
        "comment": "If you dont say it in Glasgow its an insult, smile, nod, good morning...unless your a macho twat. Thats got to be from an American...lol..men have posture as they dont have real self confidence...",
        "toxicity": 0
    },
    {
        "id": 223,
        "name": "Nightruin",
        "comment": "The entire US Armed forces is gay then.\nRequired greeting is “Good (time of day)”",
        "toxicity": 1
    },
    {
        "id": 224,
        "name": "Woodyee101",
        "comment": "It’s best to just say “morn’n”. In a deep manly voice. This will avoid the confusion",
        "toxicity": 0
    },
    {
        "id": 225,
        "name": "Zealousideal-Law-474",
        "comment": "It's only ever gay to say good morning to another man when there is a man around who is insecure in their sexuality.",
        "toxicity": 1
    },
    {
        "id": 226,
        "name": "SovelissGulthmere",
        "comment": "It is SO absurd that your dad may be overcompensating to hide something about himself",
        "toxicity": 0
    },
    {
        "id": 227,
        "name": "OmegaGoober",
        "comment": "The dad sounds like a deeply insecure closet case who is projecting his inner struggle to “pass” onto his son.",
        "toxicity": 0
    },
    {
        "id": 228,
        "name": "Mingerfabulous",
        "comment": "It's not gay if you have a glove on!",
        "toxicity": 1
    },
    {
        "id": 229,
        "name": "aredd007",
        "comment": "Toxic masculinity",
        "toxicity": 0
    },
    {
        "id": 230,
        "name": "PotentialElk831",
        "comment": "Fellas, is it gay to pray? I mean, you're literally kneeling down for another man.",
        "toxicity": 1
    },
    {
        "id": 231,
        "name": "Anomalous17",
        "comment": "Good morning f@ggz",
        "toxicity": 0
    },
    {
        "id": 232,
        "name": "shankster1987",
        "comment": "I think the dudes dad is probably projecting a bit because he is uncomfortable with his own homosexual feelings.",
        "toxicity": 1
    },
    {
        "id": 233,
        "name": "mcmonsoon",
        "comment": "It’s totally gay. What a very gay thing to even ask on gay Reddit. Can’t think of a more gay thing than what he did. So gay.",
        "toxicity": 1
    },
    {
        "id": 234,
        "name": "luminous_beings",
        "comment": "In my opinion, people that have a long list of ridiculously normal things you can’t do because it’s “gay” are just people who were thinking about gay stuff while doing those normal things\nMe thinks they dost protest too much.",
        "toxicity": 1
    },
    {
        "id": 235,
        "name": "TerryTowellinghat",
        "comment": "I’m 50 now. My dad is 78. We get along fine these days. I can remember two times he basically told me I’m giving off gay vibes. One was when he told off for standing with my hands on my hips. Apparently that was gay. The other one really hurt at the time (I got over it almost immediately) but he told me off for picking up my beer near the rim rather than at the base. Gay. I think it hurt because I was enjoying a dad-bonding moment at the time which was a moment for me at 18. There was another time much later.when I mentioned that the grandson of an elderly friend of ours was a ridiculously good looking guy. Sure it sounds gay but it really wasn’t. The downside was that although he didn’t say anything at the time, he chose to bring it up when this guy was present a few months later. I’m totally not gay. This guy was undeniably model good looking while working as a cowboy and mine electrician pulling down stacks and playing rugby on the weekend. Dad was diagnosed with alzheimers a few years later and this probably should have been my first warning.",
        "toxicity": 1
    },
    {
        "id": 236,
        "name": "jlysc",
        "comment": "When someone asks what “toxic masculinity” looks like, I’m gonna show them this.",
        "toxicity": 1
    },
    {
        "id": 237,
        "name": "[deleted]",
        "comment": "Truly amazing some men are this insecure. God help them.",
        "toxicity": 0
    },
    {
        "id": 238,
        "name": "stevengreen11",
        "comment": "Your poor father sounds very insecure. Good morning is something manly men have been telling each other for centuries. Wtf is he on about?",
        "toxicity": 0
    },
    {
        "id": 239,
        "name": "0rganicMach1ne",
        "comment": "Imagine having masculinity so fragile that being polite is gay.",
        "toxicity": 1
    },
    {
        "id": 240,
        "name": "thedelagate",
        "comment": "You may live in Florida",
        "toxicity": 0
    },
    {
        "id": 241,
        "name": "Thegrizzlybearzombie",
        "comment": "Only if you are inside of him when you say it. Otherwise is a pleasantry and your dad may be a little too sensitive about it.",
        "toxicity": 0
    },
    {
        "id": 242,
        "name": "advisingsnake",
        "comment": "Men worrying about if other men think they’re gay or not have some serious issues imo.",
        "toxicity": 1
    },
    {
        "id": 243,
        "name": "Souchirou",
        "comment": "First, there is nothing wrong with being gay.\nSecond, and it hurts that i have to say that, but saying good morning to someone regardless of age, gender or species is NOT gay. It has never been gay and will never be gay. It's saying good morning.\nThirdly even if both of the men in question where 100% gay unless they where in a relationship with each other them saying good morning to each other still isn't gay.",
        "toxicity": 1
    },
    {
        "id": 244,
        "name": "itsYewge",
        "comment": "I think Your dad might be a little sweet himself.",
        "toxicity": 0
    },
    {
        "id": 245,
        "name": "FALLASLEEP4EVER",
        "comment": "Should've just said \"I'm not gay but my boyfriend is\" and walked away",
        "toxicity": 1
    },
    {
        "id": 246,
        "name": "authenticlives",
        "comment": "Not gay. Maybe a bit presumptuous though. At work I just say “morning” cause owing to the fact that I’m at work it most definitely is not good.",
        "toxicity": 1
    },
    {
        "id": 247,
        "name": "NeighborhoodNo6739",
        "comment": "Your dad is probably a man lover",
        "toxicity": 0
    },
    {
        "id": 248,
        "name": "Fearless_Quail1404",
        "comment": "Your Dad is gay AF lol that's why he gives a shit.",
        "toxicity": 1
    },
    {
        "id": 249,
        "name": "Joshwoagh",
        "comment": "His dad is closed closeted gay, he gets aroused at other men being kind to him.",
        "toxicity": 1
    },
    {
        "id": 250,
        "name": "Tomburgerstand",
        "comment": "Life with republicans",
        "toxicity": 0
    },
    {
        "id": 251,
        "name": "xpicklemanx99",
        "comment": "Since when are manners gay?",
        "toxicity": 1
    },
    {
        "id": 252,
        "name": "Rp0605",
        "comment": "Fellas, is it gay to be polite?",
        "toxicity": 1
    },
    {
        "id": 253,
        "name": "Stainless-S-Rat",
        "comment": "Sounds like Daddy is compensating for something. It happened to a friend of my sisters, her dad was straight as an arrow until he turned 50. Next thing you know the business is sold, he's divorced and moved to Sweden with his 24 year old boyfriend to get married.",
        "toxicity": 0
    },
    {
        "id": 254,
        "name": "Fabulous-Elk-8130",
        "comment": "Last time i checked “good morning” didn’t have a gender ..",
        "toxicity": 0
    },
    {
        "id": 255,
        "name": "ironicmirror",
        "comment": "Hate to break it to you, but your father is a closet homosexual and incredibly embarrassed about that and will never reel that fact to anyone.",
        "toxicity": 1
    },
    {
        "id": 256,
        "name": "moonenergy",
        "comment": "this is toxic masculinity",
        "toxicity": 1
    },
    {
        "id": 257,
        "name": "GOhevoc204",
        "comment": "I feel like the only people that would have a problem with something as innocuous as saying good morning because it might be thought of as gay are those who are not secure with their own masculinity.",
        "toxicity": 1
    },
    {
        "id": 258,
        "name": "Joe656x",
        "comment": "Next you’ll be telling him good night",
        "toxicity": 0
    },
    {
        "id": 259,
        "name": "Spiritual_Reading_45",
        "comment": "Good morning fellow men!",
        "toxicity": 0
    },
    {
        "id": 260,
        "name": "ColdFreeezer",
        "comment": "I tell all the rednecks at my construction job “mornin” and I’m not gay yet so probably not gay",
        "toxicity": 1
    },
    {
        "id": 261,
        "name": "Iemand-Niemand",
        "comment": "Situation is so absurd I’m wondering if it’s not a shitpost.\nAfter all, “Fellas is it gay to…” was meme for a while",
        "toxicity": 1
    },
    {
        "id": 262,
        "name": "LostNbound",
        "comment": "0:00\n0:00\n0:00",
        "toxicity": 0
    },
    {
        "id": 263,
        "name": "capodecina2",
        "comment": "No, saying \"good morning\" to another man is not gay. If you are looking to gay it up a bit, try saying \"good morning\" while rubbing dicks together, that should do it. You already made eye contact, so you are halfway there. You cant just shake hands anymore because of COVID, so you gotta go with the chub rub if you are trying to cruise the laundrymat.",
        "toxicity": 1
    },
    {
        "id": 264,
        "name": "One_Stiff_Bastard",
        "comment": "Your dad crazy as hell ...",
        "toxicity": 0
    },
    {
        "id": 265,
        "name": "Aggromix",
        "comment": "Context is everything. Who you said it to and where you said it. If he's a construction worker, but doesn't sing YMCA or Macho Man, you might reconsider it.\nHave been related to persons in construction.",
        "toxicity": 0
    },
    {
        "id": 266,
        "name": "switcharoohoo",
        "comment": "It’s only gay if you say it while suckin’ some dick.",
        "toxicity": 1
    },
    {
        "id": 267,
        "name": "JawaSmasher",
        "comment": "So long you don't make eye contact",
        "toxicity": 0
    },
    {
        "id": 268,
        "name": "dadwillsue",
        "comment": "First it’s good morning, then it’s thank you, next thing you know you’re on your hands and knees begging for some other man’s seed!\n/s",
        "toxicity": 0
    },
    {
        "id": 269,
        "name": "Odd_Party",
        "comment": "I’m surprised the police didn’t roll up and ask your dad if he had a permit to be such a silly goose.",
        "toxicity": 0
    },
    {
        "id": 270,
        "name": "TheKolyFrog",
        "comment": "I remember being a kid and actually believing this kind of shit. It's so silly looking back at it but I was legitimately afraid that if I do the \"wrong\" thing I would turn gay. Add the fact that I was raised Baptist and you can imagine how much it bothered me.",
        "toxicity": 1
    },
    {
        "id": 271,
        "name": "dembonezz",
        "comment": "Nope. Your dad is projecting his insecurities and phobias on to you, make contact with all the eyes, and say good morning to whomever.\nThe world is so much more fun when you're ready to acknowledge the other people in it without fear.",
        "toxicity": 0
    },
    {
        "id": 272,
        "name": "Khum_MaRk09",
        "comment": "No. But it's just wierd sometimes.",
        "toxicity": 0
    },
    {
        "id": 273,
        "name": "shosuko",
        "comment": "The irony is by \"gay\" they mean insecure, yet caring so much about what another guy thinks about you is extremely insecure.",
        "toxicity": 1
    },
    {
        "id": 274,
        "name": "HelloKitty36911",
        "comment": "Why on earth would i care that a stranger thinks i'm gay?",
        "toxicity": 1
    },
    {
        "id": 275,
        "name": "kct_444",
        "comment": "I think your dad might be a closet gay",
        "toxicity": 1
    },
    {
        "id": 276,
        "name": "Renegade_Spectre",
        "comment": "Providing both of you are facing east, there’s no eye contact, the wind is below 4 mph and neither of you are walking a dog, then theoretically you should be fine.",
        "toxicity": 0
    },
    {
        "id": 277,
        "name": "ImportantDirector5",
        "comment": "I swear to God the obsession woth proving you aren't gay is wrecking men. Some don't even wash their ass anymorw",
        "toxicity": 1
    },
    {
        "id": 278,
        "name": "Unicorn_Warrior1248",
        "comment": "Sounds gay to me. But I’m gay 🤷🏻‍♂️ good morning men of Reddit!",
        "toxicity": 1
    },
    {
        "id": 279,
        "name": "04rallysti",
        "comment": "Next time just say “how’s it hanging?” Much better greeting.",
        "toxicity": 0
    },
    {
        "id": 280,
        "name": "NotUnstoned",
        "comment": "Fellas, is it gay to have a good morning?",
        "toxicity": 1
    },
    {
        "id": 281,
        "name": "ksidney26",
        "comment": "Low quality bait.",
        "toxicity": 0
    },
    {
        "id": 282,
        "name": "mcx112",
        "comment": "Your father is an idiot.",
        "toxicity": 1
    },
    {
        "id": 283,
        "name": "linksawakening82",
        "comment": "Dudes dad is gay.",
        "toxicity": 1
    },
    {
        "id": 284,
        "name": "bugmom",
        "comment": "Sounds like a guy who invests entirely too much energy in thinking about what is gay.",
        "toxicity": 1
    },
    {
        "id": 285,
        "name": "Car_is_mi",
        "comment": "Can you imagine having such a fragile ego that hearing another man say 'good morning' to you makes you feel homophobic?",
        "toxicity": 1
    },
    {
        "id": 286,
        "name": "Lazy-Adeptness-2343",
        "comment": "If your masculinity is so fragile that you can’t say good morning to someone without feeling gay, then you weren’t that much of a man to begin with.",
        "toxicity": 1
    },
    {
        "id": 287,
        "name": "Excellent-Throat5582",
        "comment": "I can’t take straight guys seriously.",
        "toxicity": 0
    },
    {
        "id": 288,
        "name": "Someoneoverthere42",
        "comment": "Fellas, is it gay to acknowledge another person’s existence?",
        "toxicity": 1
    },
    {
        "id": 289,
        "name": "Nir91",
        "comment": "Fragile straight men are exhausting",
        "toxicity": 0
    },
    {
        "id": 290,
        "name": "ABotelho23",
        "comment": "Dad is gay.",
        "toxicity": 1
    },
    {
        "id": 291,
        "name": "feeblebee",
        "comment": "What a sad world we live in",
        "toxicity": 0
    },
    {
        "id": 292,
        "name": "MikeDog2",
        "comment": "If you say good morning and that you have a \"case of the mondays\" then yes it is gay..",
        "toxicity": 1
    },
    {
        "id": 293,
        "name": "Legosheep",
        "comment": "Jesus Christ that man's father has issues.",
        "toxicity": 0
    },
    {
        "id": 294,
        "name": "Five-and-Dimer",
        "comment": "Hmm, I tell my gay neighbor good morning on a regular basis. Been doing it for decades. Never been a problem there, or “out on the street”.",
        "toxicity": 1
    },
    {
        "id": 295,
        "name": "Minimum-Test-2693",
        "comment": "i’m gay and say “good morning” to men ergo yes it is. qed.",
        "toxicity": 1
    },
    {
        "id": 296,
        "name": "Iliamna_remota",
        "comment": "Duh. You say good morning then IMMEDIATELY add \"no homo\".",
        "toxicity": 0
    },
    {
        "id": 297,
        "name": "Material-Constant-45",
        "comment": "I mean, if his dick is in your ass when you say it, then I could see where it might be a little gay.",
        "toxicity": 1
    },
    {
        "id": 298,
        "name": "Karpalet",
        "comment": "Wtf it's not gay at all. When greetings turned into being gay?",
        "toxicity": 1
    },
    {
        "id": 299,
        "name": "fleeyevegans",
        "comment": "Good morning to everyone that says good morning back.",
        "toxicity": 0
    },
    {
        "id": 300,
        "name": "Youcrywecrylawl",
        "comment": "Your dad is one weird mf. So is mine tho.",
        "toxicity": 0
    },
    {
        "id": 301,
        "name": "__Sotto_Voce__",
        "comment": "Absurd and sad. Your dad sounds like a bigot.",
        "toxicity": 1
    },
    {
        "id": 302,
        "name": "GrymmOdium",
        "comment": "You know what's gay? Being sexually attracted to the body and genitals of someone with the same biological makeup as you. It's actually the ONLY gay thing you can do. Crazy, right?",
        "toxicity": 1
    },
    {
        "id": 303,
        "name": "emhe1234",
        "comment": "Only in Target",
        "toxicity": 0
    },
    {
        "id": 304,
        "name": "medman143",
        "comment": "Maybe to your perverted closeted dad. Normal people say good morning.",
        "toxicity": 0
    },
    {
        "id": 305,
        "name": "Shamino79",
        "comment": "Sound like the dealer/videographers dad in American Beauty. He saw gay everywhere because he was aggressively closeted.",
        "toxicity": 1
    },
    {
        "id": 306,
        "name": "dmoral25",
        "comment": "Yeah that’s pretty gay. It’s pretty gay too to say what’s up to your dad. It’s pretty gay to even acknowledge his presence. In fact, it’s pretty gay you even thought about another man, let alone even thinking about saying something to him.\nYou should just go back to bed and start the day over. And don’t even think about saying goodnight to your dad ‘cause that’s gay. It’s already pretty gay you’re even thinking of saying goodnight to another man. At that point you’re just thinking about other guys again.\nMan, you know what? I think you’re just gay for even breathing at this point.\n/s, obviously",
        "toxicity": 1
    },
    {
        "id": 307,
        "name": "BrotherAmazing",
        "comment": "Possible explanations:\nDad is homophobic and the events occurred just as described and we imagine\nDad is homophobic but the events occurred a little differently than we imagine. For example, son said ‘Good morning!’ like he was Richard Simmons very emphatically, but that greeting could mean many things that are not “gay” (happy cult members in “happy cults” do this sometimes, for example) and dad just homophobic.\nLess likely but possible, Dad is still homophobic but the “gay” thing didn’t come out of nowhere and OP is really leaving some key elements out of the story. Like he licked his lips and stared at the man up and down and went “OooooOw! Hell-OH! Good Mornin’ sugar!” or something.",
        "toxicity": 1
    },
    {
        "id": 308,
        "name": "piplup27",
        "comment": "Why do (some) men work so hard to compound their loneliness problem?",
        "toxicity": 0
    },
    {
        "id": 309,
        "name": "Tylenolpainkillr",
        "comment": "This breaks my heart. My dad was super homophobic, to the point where as a teenager I thought it was gay to hug other guys. Seriously went on a church outting to play basketball saw two guts hug over a good play and asked “are y’all gay or something?” They laughed and asked if I ever hugged anyone.\nThat fucked me up way more than I thought anything ever would, took years to unpack my shit",
        "toxicity": 1
    },
    {
        "id": 310,
        "name": "Riyosha-Namae",
        "comment": "Is this what toxic masculinity looks like?",
        "toxicity": 1
    },
    {
        "id": 311,
        "name": "Respop",
        "comment": "This makes me so sad",
        "toxicity": 0
    },
    {
        "id": 312,
        "name": "Competitive_Mall6401",
        "comment": "Pops is being absurd, and if you live/work in a polite society (say, a professional workplace or exclusive community) his suggestions for replacements are bad advice.",
        "toxicity": 0
    },
    {
        "id": 313,
        "name": "mothboy",
        "comment": "Your dad is a little worried about you. Tell him you are fine, and to mind his own business.\nSay \"hi\" to anybody you want. Strike up a conversation if you want. If you see an obvious gay man your age (and I am assuming you are not gay) and you want to say hi and strike up a conversation, then do it. Neither of you will be confused.",
        "toxicity": 1
    },
    {
        "id": 314,
        "name": "Kerminetta_",
        "comment": "Y’all must not be from the south. It’s criminal to walk into a barbershop full of men and not say good morning.",
        "toxicity": 0
    },
    {
        "id": 315,
        "name": "unbalanc2d",
        "comment": "I can’t imagine being so insecure that I’m worried a kind greeting might ruin ‘my image’",
        "toxicity": 0
    },
    {
        "id": 316,
        "name": "jebediah999",
        "comment": "Tell both the laundromat attendant and your dad to get fucked. together if they wish.",
        "toxicity": 1
    },
    {
        "id": 317,
        "name": "Expensive-Safe-6820",
        "comment": "Guys is it gay to be polite to people",
        "toxicity": 1
    },
    {
        "id": 318,
        "name": "_MisterHighway_",
        "comment": "That \"man\" has some massive insecurities.",
        "toxicity": 0
    },
    {
        "id": 319,
        "name": "Economy_Commission79",
        "comment": "this has to be ragebait...its hard for me to believe that thers people that stupid.",
        "toxicity": 1
    },
    {
        "id": 320,
        "name": "Ekonchan",
        "comment": "I'd say his dad and men living around his area have very small penises so they insecure about their manhood.",
        "toxicity": 0
    },
    {
        "id": 321,
        "name": "Beneficial-Permit-84",
        "comment": "Hell no. Its a respect thing. I hate when guys say that. I (f23) definitely am one for a masculine man, but a guy being polite and saying good morning to another man is not gay.\nThats like me telling another girl “whats up” and my mom being like “are you into girls?” No… its just the language?!?! What the heck",
        "toxicity": 1
    },
    {
        "id": 322,
        "name": "Smoothpropagator",
        "comment": "Toxic masculinity has reached new levels, trying to look tough at a laundromat\n(I use the laundromat too no hate here)",
        "toxicity": 0
    },
    {
        "id": 323,
        "name": "Bowman01PMC",
        "comment": "Real men greet people by smashing an empty beer can over their head and hooting",
        "toxicity": 0
    },
    {
        "id": 324,
        "name": "tegh77",
        "comment": "Ur dads in the closet.",
        "toxicity": 0
    },
    {
        "id": 325,
        "name": "vampeyere",
        "comment": "short answer: no\nlong answer: no it is not gay for a man to say good morning to another man.",
        "toxicity": 1
    },
    {
        "id": 326,
        "name": "LalisSipiMoa_7293",
        "comment": "Idgaf I’m saying good morning because I feel like saying good morning, that’s the manly thing to do",
        "toxicity": 0
    },
    {
        "id": 327,
        "name": "Hargelbargel",
        "comment": "Sounds legit. I'm pretty sure, \"How are you?\" Just means, \"How would you like it in your bung hole?\" \"Excuse me,\" is gay code for \"Spray your love mustard all over my bare chest.\"",
        "toxicity": 1
    },
    {
        "id": 328,
        "name": "Glass_Feature_6446",
        "comment": "If he said \"What a fabulous morning, darling.\", I could see it.\nGood morning is neutral.",
        "toxicity": 0
    },
    {
        "id": 329,
        "name": "richardun",
        "comment": "That's not gay... That's an intense fear of things not understood. You are in control of your decisions and emotions. Even if you were inclined that way, that's your business and it's perfectly ok.\nSo, good morning!",
        "toxicity": 1
    },
    {
        "id": 330,
        "name": "Richbrownmusic",
        "comment": "Lmao that is some weird American homophobic boomer shit right there. In the uk (north) all the old timers say hello, good morning 'eyup'. A man the same age may even say 'eyup love' to you! Please bring him over he will implode.",
        "toxicity": 1
    },
    {
        "id": 331,
        "name": "VolvoInDetroit",
        "comment": "This stuff gets me every single time lol. Had a good friend of mine offer to let me take a sip of a cocktail he ordered and this is what he said: \"No homo but do you want to try this? It's delicious\".\nWhat? It's not like you're sucking me off while I'm tasting a high end cocktail.",
        "toxicity": 0
    },
    {
        "id": 332,
        "name": "cheezeyballz",
        "comment": "I wish we'd go back to minding our own business and not talking to every stranger on the street.",
        "toxicity": 0
    },
    {
        "id": 333,
        "name": "DrJohnIT",
        "comment": "There is absolutely nothing wrong with saying Good Morning to anyone anywhere. Just don't follow it up with beautiful, sexy, or honey buns to a guy because Then they would know that you're gay. Ha haha 😄",
        "toxicity": 1
    },
    {
        "id": 334,
        "name": "johnnywayne28",
        "comment": "Nope, but it sounds like your Dad is so insecure about his sexuality he is one untied shoe lace from tripping mouth first onto a penis.",
        "toxicity": 1
    },
    {
        "id": 335,
        "name": "Inator-Maker",
        "comment": "I can settle this and any other similar debates very quickly and easy. There is only one thing that makes you gay. That is being exclusively attracted to member of the same sex. Anything is just bullshit.",
        "toxicity": 1
    },
    {
        "id": 336,
        "name": "elbookworm",
        "comment": "I think it’s ridiculous for good manners to be strictly associated with homosexuality. It’s absurd. And it’s how chivalry has died. We gotta change this as a society.",
        "toxicity": 1
    },
    {
        "id": 337,
        "name": "LoneWulf14",
        "comment": "This has the same energy as \"its gay to wash my own ass\"",
        "toxicity": 1
    },
    {
        "id": 338,
        "name": "FireWokWithMe88",
        "comment": "How old is your father?\n\"Guys would think you are a little sweet.\" is slang that I have never heard before.",
        "toxicity": 0
    },
    {
        "id": 339,
        "name": "Inevitable_Pie2462",
        "comment": "Is Katy perry gay Dave?",
        "toxicity": 1
    },
    {
        "id": 340,
        "name": "Brostne",
        "comment": "Next time just say, “no homo” afterwards",
        "toxicity": 0
    },
    {
        "id": 341,
        "name": "rightoldgeezer",
        "comment": "It’s more appropriate to say “What’s the story morning glory”",
        "toxicity": 0
    },
    {
        "id": 342,
        "name": "HawXProductions",
        "comment": "0:00\n0:00\n0:00",
        "toxicity": 0
    },
    {
        "id": 343,
        "name": "9998000",
        "comment": "Sorry to break it to you, but your dad is gay.\nProjection is a heck of a thing.",
        "toxicity": 1
    },
    {
        "id": 344,
        "name": "JynFlyn",
        "comment": "Here the unironic answer. The reason it’s gay to say “Good morning” to a man is because people like this man’s father teach their kids that it’s gay to say “Good morning” to a man. Pretty simple.",
        "toxicity": 1
    },
    {
        "id": 345,
        "name": "hailzulu",
        "comment": "Nothing screams I’m not OK like creating sexuality for a stranger’s very common salutation in passing.",
        "toxicity": 1
    },
    {
        "id": 346,
        "name": "after12delight",
        "comment": "And this is how you found out your dad is gay",
        "toxicity": 1
    },
    {
        "id": 347,
        "name": "champarey",
        "comment": "Next time say, \"Gay Moaning.\"",
        "toxicity": 0
    },
    {
        "id": 348,
        "name": "toongrowner",
        "comment": "I think your dad would hate europe",
        "toxicity": 0
    },
    {
        "id": 349,
        "name": "joyloveroot",
        "comment": "Maybe your dad is secretly suppressing some gay desires himself?",
        "toxicity": 1
    },
    {
        "id": 350,
        "name": "YuriiRud",
        "comment": "You can say good morning to a man, just don't touch his penis after thats and you are fine.",
        "toxicity": 0
    },
    {
        "id": 351,
        "name": "ticktockbent",
        "comment": "Sounds like his dad knows an awful lot about how gay men socialize...",
        "toxicity": 1
    },
    {
        "id": 352,
        "name": "BootBitch13",
        "comment": "Well in the Marine Corps they make you say \"Good Morning/Afternoon/Evening\" on the daily so...\nYeah it's extremely gay.",
        "toxicity": 1
    },
    {
        "id": 353,
        "name": "jackerman21",
        "comment": "Someone has a fragile masculinity",
        "toxicity": 0
    },
    {
        "id": 354,
        "name": "SickARose",
        "comment": "Always has been",
        "toxicity": 0
    },
    {
        "id": 355,
        "name": "CharPhoe2020",
        "comment": "If you mumbled Good Morning with a mouth full of cock… that could be classed as a little bent I suppose",
        "toxicity": 0
    },
    {
        "id": 356,
        "name": "adamjames777",
        "comment": "You have to have a licence to own a gun, have to pass a test to drive a car, but any fool can become a father.",
        "toxicity": 0
    },
    {
        "id": 357,
        "name": "THSSFC",
        "comment": "I mean, come on. I've been told it's gay to watch heterosexual porn.\nClearly saying \"good morning\" to a guy is flaming.",
        "toxicity": 1
    },
    {
        "id": 358,
        "name": "DRURLF",
        "comment": "The dad is probably gay",
        "toxicity": 1
    },
    {
        "id": 359,
        "name": "Trinidaddy13",
        "comment": "His dad is projecting.",
        "toxicity": 0
    },
    {
        "id": 360,
        "name": "xxCMWFxx",
        "comment": "I had no idea the entire country of Canada was gay lol… we all do this\nOr the vast majority anyways",
        "toxicity": 1
    },
    {
        "id": 361,
        "name": "themiracy",
        "comment": "I mean if you say good morning to him because you wake up in bed with him and you got it on last night, kinda sorta, but otherwise, yeah, no.",
        "toxicity": 1
    },
    {
        "id": 362,
        "name": "BrickTamland77",
        "comment": "Is \"good morning\" a phrase? I'm only familiar with the standard declaration of the fact that it is indeed morning, \"mornin.\"",
        "toxicity": 0
    },
    {
        "id": 363,
        "name": "Techn0ght",
        "comment": "I'm guessing his dad doesn't wipe or wash his ass either.",
        "toxicity": 0
    },
    {
        "id": 364,
        "name": "Listening_Heads",
        "comment": "FYI: it’s extremely likely that your dad did something gay in the past and is now overcompensating for that.",
        "toxicity": 1
    },
    {
        "id": 365,
        "name": "mac2o2o",
        "comment": "Sounds like your fathers insecurities coming out, or maybe he thinks you aren't \"manly enough\" ? He also has a new obvious small-minded opinions too\nHow old is he?",
        "toxicity": 0
    },
    {
        "id": 366,
        "name": "Hellman9615",
        "comment": "FELLAS!! FELLAS!! Is having manners GAY?!?!",
        "toxicity": 0
    },
    {
        "id": 367,
        "name": "Negative_Fruit_6684",
        "comment": "So there's this thing called toxic masculinity....",
        "toxicity": 1
    },
    {
        "id": 368,
        "name": "LiesInRuins",
        "comment": "It’s true though. I went to the grocery store this morning and said “good morning” to a guy exiting the store and next thing you know he was yanking on my crank behind the dumpster.",
        "toxicity": 0
    },
    {
        "id": 369,
        "name": "HothHalifax",
        "comment": "That’s been my go to pickup line at gay bars for over 10 years… “good morning “. Works every time I tell ya.",
        "toxicity": 1
    },
    {
        "id": 370,
        "name": "Booty_Warrior_bot",
        "comment": "I likes ya;\nand I wants ya.",
        "toxicity": 0
    },
    {
        "id": 371,
        "name": "KennyWolf",
        "comment": "FELLAS, is it gay to kiss a woman? I mean… you’re literally kissing someone who loves to suck cock.",
        "toxicity": 1
    },
    {
        "id": 372,
        "name": "HothHalifax",
        "comment": "That’s been my go to pickup line at gay bars for over 10 years… “good morning “. Works every time I tell ya.",
        "toxicity": 1
    },
    {
        "id": 373,
        "name": "Lost-Challenge7790",
        "comment": "Saying good morning to a man: A little gay.\nYour dad bothering to notice it and then referring to gay as “sweet”: A lot gay.",
        "toxicity": 1
    },
    {
        "id": 374,
        "name": "SquidleyStudios",
        "comment": "Guys will propagate the idea that being nice to each other in any way whatsoever will brand them as gay and then turn around and wonder why men's mental health is so shit",
        "toxicity": 1
    },
    {
        "id": 375,
        "name": "BNeutral",
        "comment": "Maybe he said \"wood morning\"",
        "toxicity": 0
    },
    {
        "id": 376,
        "name": "Majestic_Score_2217",
        "comment": "That is complete nonsense. You continue being the classy person you are. This world needs more people like you.",
        "toxicity": 0
    },
    {
        "id": 377,
        "name": "FunkIPA",
        "comment": "Your dad might be gay.",
        "toxicity": 1
    },
    {
        "id": 378,
        "name": "350",
        "comment": "This is the stupidest fucking thing I have read all week. Good morning is literally just a morning greeting. What is fucking wrong with people.",
        "toxicity": 1
    },
    {
        "id": 379,
        "name": "rastika",
        "comment": "You made eye contact with him? Totally gay.",
        "toxicity": 1
    },
    {
        "id": 380,
        "name": "its_all_one_electron",
        "comment": "The fact that he thinks about that so much... It seems he's super focused on not appearing gay. So you know what that means.",
        "toxicity": 1
    },
    {
        "id": 381,
        "name": "headofthenapgame",
        "comment": "Tell your dad it's gay to worry about how other men see you in terms of softness.\nLike, oh no, does Daryl think I'm too cute saying good morning?",
        "toxicity": 1
    },
    {
        "id": 382,
        "name": "Dont-PM-me-nudes",
        "comment": "Sorry - this may be my fault. Yesterday when your dad was sucking me off in my sleep, I woke up and blurted out \"Good morning\". He is probably correlating what should actually be considered disparate events. Don't get too concerned. I shall correct the misunderstanding when I dry fuck him this evening. Once again, I do apologise.",
        "toxicity": 1
    },
    {
        "id": 383,
        "name": "johnliberman41",
        "comment": "You might as well just blow him, that would be less gay",
        "toxicity": 1
    },
    {
        "id": 384,
        "name": "dremily1",
        "comment": "The next time you wonder where toxic masculinity comes from....",
        "toxicity": 1
    },
    {
        "id": 385,
        "name": "T_Bagger23",
        "comment": "Always makes me laugh at how ignorant someone can still be in the year 2023.",
        "toxicity": 0
    },
    {
        "id": 386,
        "name": "alborigano",
        "comment": "Looks like dad is maybe maybe maybe closeted.",
        "toxicity": 0
    },
    {
        "id": 387,
        "name": "Conspiracy__",
        "comment": "“Hey man, where you work does anyone ever say “sounds like you have a case of the Mondays?”",
        "toxicity": 0
    },
    {
        "id": 388,
        "name": "Selection-Huge",
        "comment": "My gym bro, who's married and has a kid, we will both send each other good morning and traditional Christian memes. I'm married and working on my first child. Just depends how gay you wanna be with that good morning.",
        "toxicity": 1
    },
    {
        "id": 389,
        "name": "hfidek",
        "comment": "that's some George Costanza level stuff here",
        "toxicity": 0
    },
    {
        "id": 390,
        "name": "Readyyyyyyyyyy-GO",
        "comment": "There is only one definite, 100% certain way to know a man is gay, and that’s how preoccupied he is with how gay other people are.\nTell your dad I said Good Morning lol",
        "toxicity": 1
    },
    {
        "id": 391,
        "name": "cosaboladh",
        "comment": "The only thing that comes to mind is the Good Morning Exercise. Which I thought was super-gay when I learned it in weights class. \"So, you thrust your ass straight back at your spotter, huh?\"\nThat said, my impression said more about me than it did the exercise itself; bisexual as I am. The back dialog in this image probably says more about the dad character than it does the phrase \"good morning.\"",
        "toxicity": 1
    },
    {
        "id": 392,
        "name": "KommandaKoopa",
        "comment": "Guys is it gay to breathe? You’re literally inhaling dick particles.",
        "toxicity": 1
    },
    {
        "id": 393,
        "name": "Odisher7",
        "comment": "Another question: if it was gay, would it be wrong? This kind of shitty mentality is extra stupid when you realize it goes from \"being gay is bad\"\nOn the positive side, at least OOP didn't just listened to their father",
        "toxicity": 1
    },
    {
        "id": 394,
        "name": "River_Odessa",
        "comment": "Fellas, is it gay to communicate with another human being?",
        "toxicity": 1
    },
    {
        "id": 395,
        "name": "burntrats",
        "comment": "Your dad might be gay.",
        "toxicity": 1
    },
    {
        "id": 396,
        "name": "Smishblurb1",
        "comment": "You went to the laundromat?!!? Pretty gayyyyy",
        "toxicity": 1
    },
    {
        "id": 397,
        "name": "pegLegNinja1",
        "comment": "Top of the morning to you fine sir.",
        "toxicity": 0
    },
    {
        "id": 398,
        "name": "trogwaffles777",
        "comment": "I don’t get this, I kiss my homies goodnight and good morning every day!?\nHaha jk yeah this guys dads a bigot. Very bizarre projection.",
        "toxicity": 1
    },
    {
        "id": 399,
        "name": "SnooFoxes3675",
        "comment": "No, but going to the laundromat with your dad is gay...",
        "toxicity": 1
    },
    {
        "id": 400,
        "name": "Elluminated",
        "comment": "Must be a regional thing. That region is your dads head",
        "toxicity": 0
    },
    {
        "id": 401,
        "name": "ThePrimordialTV",
        "comment": "FELLAS, IS IT GAY TO SAY GOOD MORNING TO A MAN, YOU’RE PRACTICALLY SAYING GOOD MORNING TO ANOTHER DICK.\nFELLAAAAAS",
        "toxicity": 0
    },
    {
        "id": 402,
        "name": "Overall-Guarantee331",
        "comment": "Only if your balls touch",
        "toxicity": 0
    },
    {
        "id": 403,
        "name": "gurkalurka",
        "comment": "Your dad is what people refer to as a “homophobe”. Show him some pictures and videos of these people. He should be able to relate.",
        "toxicity": 0
    },
    {
        "id": 404,
        "name": "Dune444444",
        "comment": "What's up??? What are we gang bangers or teenagers? Come to canada, I'll hold the fucking door while you walk a mile to get there, then I'll make akward eye contact and say something like weather sure is nice..... Oh shit, I just realized I was a Mega Ultra Gay while writing this.",
        "toxicity": 1
    },
    {
        "id": 405,
        "name": "Fit_Acadia1638",
        "comment": "Go back to bed",
        "toxicity": 0
    },
    {
        "id": 406,
        "name": "R3ddditor",
        "comment": "Sorry to tell you, but your dad is gay.",
        "toxicity": 1
    },
    {
        "id": 407,
        "name": "YaMilkaMan",
        "comment": "Did you lick your lips after saying it?",
        "toxicity": 0
    },
    {
        "id": 408,
        "name": "TrevorTheGamer",
        "comment": "\" Fellas, is it gay to greet people ? \"",
        "toxicity": 1
    },
    {
        "id": 409,
        "name": "autoencoder",
        "comment": "The movie \"Idiocracy\" is proving correct in every area they thought of making fun of.",
        "toxicity": 0
    },
    {
        "id": 410,
        "name": "John_waynegacy69",
        "comment": "I believe science states that nothing is gay if you aren’t erect.",
        "toxicity": 1
    },
    {
        "id": 411,
        "name": "Anxious_Cadon010",
        "comment": "Oof the straights love making their lives harder 😂",
        "toxicity": 0
    },
    {
        "id": 412,
        "name": "Jgfranco88PkmnGo",
        "comment": "You’re 23 and you’re still doing laundry with your pops? That’s pretty gay.",
        "toxicity": 1
    },
    {
        "id": 413,
        "name": "stack_of_cds",
        "comment": "Good morning to every man out there, except that guy's dad.",
        "toxicity": 0
    },
    {
        "id": 414,
        "name": "Grass_Positive",
        "comment": "Depends if your sucking his dick at the time.",
        "toxicity": 0
    },
    {
        "id": 415,
        "name": "dMONKEYMANb",
        "comment": "If you say no homo after it makes it not gay. Everyone knows that!",
        "toxicity": 1
    },
    {
        "id": 416,
        "name": "Nadgerino",
        "comment": "Next time punch them in the face then grunt.",
        "toxicity": 0
    },
    {
        "id": 417,
        "name": "aspermyprevious",
        "comment": "Yes. In fact, stop speaking or looking at all people, unless you want to be perceived as gay. Don't leave your homes, don't get online. Just sit in the dark, alone. It's the only way to be sure.",
        "toxicity": 1
    }
]